# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]


a = [2, 3, 4, 5, 6]
len_list = 0 
if len(a) % 2 == 0:     
    len_list = len(a) // 2 
else:     
    len_list = len(a) // 2 + 1 
for i in range(len_list):
    print(a[i] * a[len(a) - i -1])